Конфигурация отчетов/Documents/ПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПланаРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПланаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнении</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРаботРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФункциональныйТипПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогресБар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийКЗадаче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВыполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПланРабот</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогресБарВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОбработано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Открыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующийПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункцТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФункциональныйТипПлана</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТекущийПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/РодительЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РодительЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/СтатусыЗадач_1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗадач_1</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/ФункциональныйТипПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФункциональныйТипПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПланПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланЗадача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инициатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/СменаСтатуса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СменаСтатуса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗадач_1</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/СписокЭтаповВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СписокЭтаповВыполнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Задачи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Documents/ПланРабот/Ext/ManagerModule.bsl
//Создание Документа плана работ
Функция СозданиеДокументаПланаРабот(ДатаДок,СсылкаНаЗаказКлиент,Заказ,Ответственный,СтатусВыполнения,СрокВыполнения,СсылкаНаПланРабот,ТипПланаРабот,ОбъектКлиента,ФункциональныйТип, Задача) Экспорт 
	ПланРабот = Документы.ПланРабот.СоздатьДокумент();
	ПланРабот.Дата = ДатаДок;
	ПланРабот.СсылкаНаЗаказ = СсылкаНаЗаказКлиент;
	ПланРабот.ОписаниеЗадачи = Заказ;
	ПланРабот.Ответственный = Ответственный;
	ПланРабот.СтатусВыполнения = СтатусВыполнения;
	ПланРабот.СрокВыполнении = СрокВыполнения;
	ПланРабот.ПланРаботРодитель = СсылкаНаПланРабот;
	ПланРабот.ТипПланаРабот = ТипПланаРабот;
	ПланРабот.Объект = ОбъектКлиента;
	ПланРабот.ФункциональныйТип = ФункциональныйТип;
	ПланРабот.Задача = Задача;
	
	//заполнение этапов
	Если ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланПроект Тогда
		Владелец = Задача; 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписокЭтаповВыполнения.Владелец КАК Владелец,
			|	СписокЭтаповВыполнения.Ответственный КАК Ответственный,
			|	СписокЭтаповВыполнения.Задача КАК Задача,
			|	СписокЭтаповВыполнения.Исполнитель КАК Исполнитель,
			|	СписокЭтаповВыполнения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СписокЭтаповВыполнения КАК СписокЭтаповВыполнения
			|ГДЕ
			|	СписокЭтаповВыполнения.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекЭтап = ПланРабот.Этапы.Добавить();
			ТекЭтап.ЗадачаСсылка = Выборка.Задача;             //ссылка на задачу в спр задачи
			ТекЭтап.Задача = Выборка.Задача.Наименование;                   //текстовое представление задачи
			ТекЭтап.Ответственный = Выборка.Ответственный;
			ТекЭтап.Исполнитель = Выборка.Исполнитель;
			ТекЭтап.СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
			ТекЭтап.ПроцентВыполнения = "0 %";
		КонецЦикла;
	
		
	КонецЕсли;
	ПланРабот.Записать();
	Сообщить("План выполнения работ успешно создан");
	
	Возврат ПланРабот.Ссылка;  
	
КонецФункции

Функция ПолучитьСледЗадачу(СсылкаНаПлан) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРаботЭтапы.СсылкаНаПланРабот КАК СсылкаНаПланРабот,
		|	ПланРаботЭтапы.Ссылка КАК Ссылка,
		|	ПланРаботЭтапы.СтатусВыполнения КАК СтатусВыполнения
		|ИЗ
		|	Документ.ПланРабот.Этапы КАК ПланРаботЭтапы
		|ГДЕ
		|	ПланРаботЭтапы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаПлан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.СсылкаНаПланРабот;
		АктуальныйСтатус = Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Ссылка);
		Если АктуальныйСтатус <> Перечисления.СтатусВыполнения.Завершено Тогда
			Возврат Выборка.СсылкаНаПланРабот;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;   //означает что завершать надо сам план
			
КонецФункции

Процедура АктивироватьСледующуюЗадачу(СсылкаНаПланРодитель) Экспорт      //в плане родитель инфа о следующих шагах
	ЗадачаДляАктивации = ПолучитьСледЗадачу(СсылкаНаПланРодитель);	
	Если ЗадачаДляАктивации = Неопределено Тогда //либо задачи все выполнены. Завершаем текущий план
		ЗадачаДляАктивации = СсылкаНаПланРодитель; 	
		ЗавершитьЗадачу = Истина;
	КонецЕсли;
	ПланРабот = ЗадачаДляАктивации.ПолучитьОбъект();
	
	Заказ = ПланРабот.СсылкаНаЗаказ;
	
	ПланРодитель = ПланРабот.ПланРаботРодитель;
	ТекПлан = ПланРабот.Ссылка;
	НовыйСтатус = Перечисления.СтатусВыполнения.ОтправленаИсполнителю;
	ТипЗадачи = ПланРабот.ФункциональныйТип; 
	Если ЗавершитьЗадачу = Истина Тогда //либо задачи все выполнены. Завершаем текущий план
		НовыйСтатус = Перечисления.СтатусВыполнения.Завершено;
	КонецЕсли;
	
	Документы.СменаСтатуса.СменаСтатуса(Заказ, ПланРодитель, ТекПлан, НовыйСтатус,ТипЗадачи);
	//ПланРодитель = СсылкаНаПланРодитель.ПолучитьОбъект();
КонецПроцедуры

Функция ПолучениеАктуальногоСтатусаЗадачи(ПланСсылка) Экспорт
	АктуальныйСтатус = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадачСрезПоследних.Регистратор КАК Регистратор,
		|	СтатусыЗадачСрезПоследних.ТекущийПлан КАК ТекущийПлан,
		|	СтатусыЗадачСрезПоследних.АктуальныйСтатус КАК АктуальныйСтатус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач.СрезПоследних КАК СтатусыЗадачСрезПоследних
		|ГДЕ
		|	СтатусыЗадачСрезПоследних.ТекущийПлан = &ТекущийПлан";
	
	Запрос.УстановитьПараметр("ТекущийПлан", ПланСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АктуальныйСтатус=Выборка.АктуальныйСтатус;		
	КонецЦикла;
	//Если Выборка.АктуальныйСтатус.ПустаяСсылка() Тогда
	//	Возврат Неопределено;	
	//Иначе
	//	Возврат Выборка.АктуальныйСтатус;
	//КонецЕсли;	
	Возврат Выборка.АктуальныйСтатус;

КонецФункции  

Функция ПроцентВыполненияЗадачи(Задача) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРабот.Ссылка КАК Ссылка,
		|	ПланРабот.ФункциональныйТип КАК ФункциональныйТип
		|ИЗ
		|	Документ.ПланРабот КАК ПланРабот
		|ГДЕ
		|	ПланРабот.Ссылка = &ТекущийПлан";
	
	Запрос.УстановитьПараметр("ТекущийПлан", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Если Выборка.ФункциональныйТип = Перечисления.ФункциональныйТипПлана.ПланЗадача Тогда
		Если Документы.ПланРабот.ПолучениеАктуальногоСтатусаЗадачи(Задача) = Перечисления.СтатусВыполнения.Завершено Тогда
			Возврат 100;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	//выбирать из документа
	//запрашивать статус
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРабот.Ссылка КАК Ссылка,
		|	ПланРабот.ПланРаботРодитель КАК ПланРаботРодитель,
		|	ПланРабот.ФункциональныйТип КАК ФункциональныйТип
		|ИЗ
		|	Документ.ПланРабот КАК ПланРабот
		|ГДЕ
		|	ПланРабот.ПланРаботРодитель = &ПланРаботРодитель";
	
	Запрос.УстановитьПараметр("ПланРаботРодитель", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОбщееКолЗадач = 0;
	ПрогресВыполнения = 0;

	Пока Выборка.Следующий() Цикл
		ОбщееКолЗадач = ОбщееКолЗадач + 1;
		ПрогресВыполнения = ПрогресВыполнения + Документы.ПланРабот.ПроцентВыполненияЗадачи(Выборка.Ссылка);
	КонецЦикла;
	
	Если ОбщееКолЗадач = 0 Тогда
		ОбщееКолЗадач = 1;
	КонецЕсли;

	
	Возврат ПрогресВыполнения/ОбщееКолЗадач; 
	

КонецФункции // ПроцентВыполненияЗадачи()

Функция ЗавершитьЗадачу(Задача) Экспорт   //проверяем закрыты ли все задачи 
	
	//получаем все вложеные задачи
	//если нету возвращаем истину
	//если есть проверяем на вложеность
	//проверяем на статус
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодительЗадачиСрезПоследних.Задача КАК Задача,
		|	РодительЗадачиСрезПоследних.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.РодительЗадачи.СрезПоследних КАК РодительЗадачиСрезПоследних
		|ГДЕ
		|	РодительЗадачиСрезПоследних.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗавершитьЗадачу(Выборка.Задача);	
	КонецЦикла;
	
	НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения, Перечисления.СтатусВыполнения.Завершено,
			ПодготовкаДанных.ПолучитьТекущегоПользователя());
		КонецФункции
		
Функция АктуальныйСтатусЗадачи(Задача) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадач_1СрезПоследних.Задача КАК Задача,
		|	СтатусыЗадач_1СрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач_1.СрезПоследних(, Задача = &Задача) КАК СтатусыЗадач_1СрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Статус;
	
КонецФункции
